#+TITLE: ED'S Emacs Configuration
#+AUTHOR: Ed Paget

* Appearance and Theme
   Hide parts of the GUI that we don't need, namely the graphical tool
   bar and any scroll bars.

   #+NAME: appearance
   #+BEGIN_SRC emacs-lisp
     (if (fboundp 'tool-bar-mode) (tool-bar-mode 0))
     (if (fboundp 'scroll-bar-mode) (scroll-bar-mode 0))
     (if (fboundp 'fringe-mode) (fringe-mode -1))
   #+END_SRC

   #+RESULTS: appearance
   : ((font . Hack-12) (vertical-scroll-bars) (left-fringe . -1) (right-fringe . -1))

   Use Moe Dark as the the theme. 

   #+NAME: appearance
   #+BEGIN_SRC emacs-lisp
     (use-package moe-theme
       :config (moe-dark))
   #+END_SRC

   We also set the font while specifying a couple fallbacks.

   #+NAME: appearance
   #+BEGIN_SRC emacs-lisp
     (cond
      ((find-font (font-spec :name "Hack"))
       (add-to-list 'default-frame-alist '(font . "Hack-12"))))
   #+END_SRC

   Highlight the current line.

   #+NAME: appearance
   #+BEGIN_SRC emacs-lisp
     (global-hl-line-mode)
   #+END_SRC

   #+NAME: appearance
   #+BEGIN_SRC emacs-lisp
     (setq ring-bell-function 'ignore)
     (setq inhibit-startup-screen t)

     ;; Set message for *scratch* buffer
     (setq initial-scratch-message ";; Hello, Ed.\n")

     ;; Never require full word answers
     (defalias 'yes-or-no-p 'y-or-n-p)
   #+END_SRC

  Add support for emojis

  #+NAME: apperance
  #+begin_src emacs-lisp
    (use-package emojify
      :diminish
      :config
      (setq emojify-program-contexts '(comments))
      :hook
      (after-init . global-emojify-mode))
  #+end_src

  #+RESULTS: apperance
  | evil-mode | global-emojify-mode | tramp-register-archive-file-name-handler | magit-maybe-define-global-key-bindings | table--make-cell-map |

* Evil Configuration

  #+NAME: evil
  #+BEGIN_SRC emacs-lisp
    (use-package evil
      :diminish undo-tree-mode
      :hook (after-init . evil-mode)
      :init
      (setq evil-want-integration t
            evil-want-C-u-scroll t
            evil-want-keybinding nil)
      :preface
      (defun ed/save-and-kill ()
        (interactive)
        (save-buffer)
        (kill-this-buffer))
      :config
      (evil-ex-define-cmd "wq" #'ed/save-and-kill))

    (use-package evil-collection
      :after evil
      :ensure t
      :custom
      (evil-collection-setup-minibuffer t)
      :init
      (evil-collection-init))
  #+END_SRC

  #+RESULTS: evil
  : t

  Going to try to use general and which key to help me remember how to use my new configuration

  #+name which-key
  #+begin_src emacs-lisp
    (use-package which-key
      :config (which-key-mode))
  #+end_src

  #+RESULTS:
  | /usr/bin | /bin | /usr/sbin | /sbin | /usr/local/Cellar/emacs-head@27/27.1_1/libexec/emacs/27.1/x86_64-apple-darwin20.2.0 | /home/edward/bin |

  #+name general
  #+begin_src emacs-lisp
    (use-package general
      :ensure t
      :config
      (general-override-mode +1))
  #+end_src

  #+RESULTS:

* Spaces Not Tabs

  #+NAME: Spaces not Tabs
  #+BEGIN_SRC emacs-lisp
    (setq-default indent-tabs-mode nil
                  tab-width 2)
  #+END_SRC

  #+RESULTS: Spaces not Tabs
  : 2

** General Lisp Stuff

Let's define all the lisp modes we want to use so other modes can hook into them.

#+Name: lisp-modes
#+begin_src emacs-lisp
  (defconst ed/lisp-mode-hook-list
    '(clojure-mode-hook emacs-lisp-mode-hook lisp-mode-hook))
#+end_src

#+RESULTS: lisp-modes
: ed/lisp-mode-hook-list

We're going to have cool looking delimiters in all the modes.

#+NAME: rainbow-parens
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

#+RESULTS: rainbow-parens
| rainbow-delimiters-mode | rainbow-delimiters | rainbow-delimiers | rainbow-delimiers-mode | linum-mode |


#+NAME: lispy
#+begin_src emacs-lisp
  (use-package lispy
    :ghook ed/lisp-mode-hook-list)

  (use-package lispyville
    :diminish (lispyville-mode-line-string " 🍰" " 🍰")
    :ghook ed/lisp-mode-hook-list
    :config (lispyville-set-key-theme '(operators prettify c-w additional)))

#+end_src

#+RESULTS: lispy
